OpenNuvoton/M480BSP/Library/StdDriver/src/sdh.c
    if ((sdh->INTSTS & SDH_INTSTS_CRC16_Msk) != SDH_INTSTS_CRC16_Msk)
    {
        /* check CRC16 */
        return SDH_CRC16_ERROR;
    }
    return 0ul;
}

/* there are 8 bits for divider0, maximum is 256 */
#define SDH_CLK_DIV0_MAX     256ul

void SDH_Set_clock(SDH_T *sdh, uint32_t sd_clock_khz)
{
    uint32_t rate, div1;
    static uint32_t u32SD_ClkSrc = 0ul;

    uint32_t u32RegLockLevel = SYS_IsRegLocked();
    if (u32RegLockLevel)
    {
    SYS_UnlockReg();
    }

    /* initial state, clock source use HIRC */
    if (sd_clock_khz <= 400ul)
    {
        if ((CLK->PWRCTL & CLK_PWRCTL_HIRCEN_Msk) != 0x4ul)
        {
            CLK->PWRCTL |= CLK_PWRCTL_HIRCEN_Msk;
        }

        if (sdh == SDH0)
        {
            u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH0SEL_Msk);
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH0SEL_Msk) | CLK_CLKSEL0_SDH0SEL_HIRC;
            _SDH0_ReferenceClock = (__HIRC / 1000ul);
        }
        else
        {
            u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH1SEL_Msk);
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH1SEL_Msk) | CLK_CLKSEL0_SDH1SEL_HIRC;
            _SDH1_ReferenceClock = (__HIRC / 1000ul);
        }
    }
    /* transfer state, clock source use sys_init() */
    else
    {
        if (sdh == SDH0)
        {
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH0SEL_Msk) | u32SD_ClkSrc;
            if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HXT)
            {
                _SDH0_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HIRC)
            {
                _SDH0_ReferenceClock = (__HIRC / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_PLL)
            {
                _SDH0_ReferenceClock = (CLK_GetPLLClockFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HCLK)
            {
                _SDH0_ReferenceClock = (CLK_GetHCLKFreq() / 1000ul);
            }
        }
        else
        {
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH1SEL_Msk) | u32SD_ClkSrc;
            if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HXT)
            {
                _SDH1_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HIRC)
            {
                _SDH1_ReferenceClock = (__HIRC / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_PLL)
            {
                _SDH1_ReferenceClock = (CLK_GetPLLClockFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HCLK)
            {
                _SDH1_ReferenceClock = (CLK_GetHCLKFreq() / 1000ul);
            }
        }

        if(sd_clock_khz >= 50000ul)
        {
            sd_clock_khz = 50000ul;
        }
    }
    if (sdh == SDH0)
    {
        rate = _SDH0_ReferenceClock / sd_clock_khz;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if ((_SDH0_ReferenceClock % sd_clock_khz) != 0ul)
        {
            rate++;
        }
    }
    else
    {
        rate = _SDH1_ReferenceClock / sd_clock_khz;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if ((_SDH1_ReferenceClock % sd_clock_khz) != 0ul)
        {
            rate++;
        }
    }

    if(rate >= SDH_CLK_DIV0_MAX)
    {
        rate = SDH_CLK_DIV0_MAX;
    }

    /*--- calculate the second divider CLKDIV0[SDHOST_N]*/
    div1 = (rate - 1ul) & 0xFFul;

    /*--- setup register */
    if (sdh == SDH0)
    {
        CLK->CLKDIV0 &= ~CLK_CLKDIV0_SDH0DIV_Msk;
        CLK->CLKDIV0 |= (div1 << CLK_CLKDIV0_SDH0DIV_Pos);
    }
    else
    {
        CLK->CLKDIV3 &= ~CLK_CLKDIV3_SDH1DIV_Msk;
        CLK->CLKDIV3 |= (div1 << CLK_CLKDIV3_SDH1DIV_Pos);
    }

    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }

    return;
}

int32_t SDH_CardDetection(SDH_T *sdh)
{
    volatile uint32_t i;
    uint32_t val = TRUE;
    SDH_INFO_T *pSD;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }


    if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) == SDH_INTEN_CDSRC_Msk)   /* Card detect pin from GPIO */
    {
        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;

        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk)   /* Card remove */
        {
            pSD->IsCardInsert = (uint8_t)FALSE;
            val = FALSE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
    }
    else if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) != SDH_INTEN_CDSRC_Msk)
    {
        sdh->CTL |= SDH_CTL_CLKKEEP_Msk;

        for (i = 0ul; i < 5000ul; i++)
        {
            __NOP();
        }

        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk)   /* Card insert */
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)FALSE;
            val = FALSE;
        }

        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;
    }

    return val;
}

uint32_t SDH_Init(SDH_T *sdh)
{
    uint32_t volatile i, status;
    uint32_t resp;
    uint32_t CIDBuffer[4];
    uint32_t volatile u32CmdTimeOut;
    SDH_INFO_T *pSD;
    uint32_t u32TimeOutCount;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    /* set the clock to 300KHz */
    SDH_Set_clock(sdh, 300ul);

    /* power ON 74 clock */
    sdh->CTL |= SDH_CTL_CLK74OEN_Msk;

    u32TimeOutCount = SDH_TIMEOUT_CNT;
    while ((sdh->CTL & SDH_CTL_CLK74OEN_Msk) == SDH_CTL_CLK74OEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }
        if (--u32TimeOutCount == 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    SDH_SDCommand(sdh, 0ul, 0ul);        /* reset all cards */
    for (i=0x1000ul; i>0ul; i--)
    {
    }

